Samraksh/eMote44/DeviceCode/Targets/Native/STM32H7/DeviceCode/STM32H7_USB/prev/STM32H7_usb_functions_v.cpp
/*
 * OTG HS Interrupt Handler
 */
void STM32H7_USB_Driver_HS_Interrupt( void* param )
{
    STM32H7_USB_Driver_Interrupt( OTG_HS, &STM32H7_USB_ControllerState[ STM32H7_USB_HS_IDX ].state );
}


USB_CONTROLLER_STATE * CPU_USB_GetState( int Controller )
{
    if( ( UINT32 )Controller >= TOTAL_USB_CONTROLLER )
        return NULL;
    
    return &STM32H7_USB_ControllerState[ STM32H7_USB_IDX( Controller ) ].state;
}

HRESULT CPU_USB_Initialize( int Controller )
{
	if( ( UINT32 )Controller >= TOTAL_USB_CONTROLLER )
        return S_FALSE;
	
	// enable USB clock
    if( STM32H7_USB_IS_HS( Controller ) )
    { // HS on AHB1
        RCC->AHB1ENR |= RCC_AHB1ENR_USB1OTGHSEN;
        // this is needed to enable the FS phy clock when the CPU is sleeping
        RCC->AHB1LPENR &= ~RCC_AHB1LPENR_USB1OTGHSULPILPEN;	
		hal_printf(" 621 USB ");		
	}
    else
    { // FS on AHB2
        SET_BIT(RCC->AHB1ENR, RCC_AHB1ENR_USB2OTGHSEN);
		hal_printf(" 625 USB ");
	}

    USB_CONTROLLER_STATE *State = &STM32H7_USB_ControllerState[ STM32H7_USB_IDX( Controller ) ].state;

    OTG_TypeDef* OTG = STM32H7_USB_REGS( Controller );

    GLOBAL_LOCK( irq );
	
	/* Select FS Embedded PHY */
	OTG->GUSBCFG |= USB_OTG_GUSBCFG_PHYSEL;
	
	/* Reset after a PHY select and set Host mode */	 
	//while ((OTG->GRSTCTL & USB_OTG_GRSTCTL_AHBIDL) == 0);
	
	//while ((OTG->GRSTCTL & USB_OTG_GRSTCTL_CSRST) == USB_OTG_GRSTCTL_CSRST);
	
	/* Deactivate the power down*/
    OTG->GCCFG = USB_OTG_GCCFG_PWRDWN;

	/* Set functional mode : Device mode */
	OTG->GUSBCFG &= ~(USB_OTG_GUSBCFG_FHMOD | USB_OTG_GUSBCFG_FDMOD); 
	
	OTG->GUSBCFG |= USB_OTG_GUSBCFG_FDMOD;
	
	OTG->DCFG |= OTG_DCFG_DSPD;           // device speed = HS
	
	
// Detach usb port for a while to enforce re-initialization
 /*   OTG->DCTL = OTG_DCTL_SDIS; // soft disconnect

    OTG->GAHBCFG = OTG_GAHBCFG_TXFELVL;     // int on TxFifo completely empty, int off
    OTG->GUSBCFG = OTG_GUSBCFG_FDMOD        // force device mode
                 | STM32H7_USB_TRDT << 10   // turnaround time
                 | OTG_GUSBCFG_PHYSEL       // internal PHY
                 | OTG_GUSBCFG_PHYLPCS;     // 48MHz PHY clock

    OTG->GCCFG |= OTG_GCCFG_PWRDWN;        // transceiver enabled

    OTG->DCFG |= OTG_DCFG_DSPD;           // device speed = HS
*/

// UNDONE: FIXME:
    if( STM32H7_USB_USE_VB_PIN( Controller ))
	{
        OTG->GCCFG |= OTG_GCCFG_VBDEN;         // enable vbus sense
	}
    if (!STM32H7_USB_USE_ID_PIN(Controller)) { // no ID pin
        OTG->GOTGCTL |= OTG_GOTGCTL_BVALOEN    // B-peripheral session valid override enable
                      | OTG_GOTGCTL_BVALOVAL;  // B-peripheral session valid override value
    }

    // setup usb state variables
    ( ( STM32H7_USB_STATE* )State )->pinsProtected = TRUE;
    State->EndpointStatus = ( ( STM32H7_USB_STATE* )State )->endpointStatus;
    State->EndpointCount = USB_MAX_EP( Controller );
    //State->DeviceStatus = USB_STATUS_DEVICE_SELF_POWERED;

    // get max ep0 packet size from actual configuration
    const USB_DEVICE_DESCRIPTOR* desc = ( USB_DEVICE_DESCRIPTOR* )USB_FindRecord( State, USB_DEVICE_DESCRIPTOR_MARKER, 0 );
    State->PacketSize = desc ? desc->bMaxPacketSize0 : DEF_EP0_SIZE;

    // use defaults for unused endpoints
    int idx;
    for( idx = 1; idx < State->EndpointCount; idx++ )
    {
        State->IsTxQueue[ idx ] = FALSE;
        State->MaxPacketSize[ idx ] = USB_MAX_DATA_PACKET_SIZE;  // 64
    }
    UINT32 epType = 0; // set all endpoints to unused
    UINT32 queueIdx = STM32H7_USB_IDX( Controller ) ? USB_MAX_EP( 0 ) - 1 : 0; // first queue buffer

    // get endpoint configuration
    const USB_ENDPOINT_DESCRIPTOR  *ep = NULL;
    const USB_INTERFACE_DESCRIPTOR *itfc = NULL;
    while( USB_NextEndpoint( State, ep, itfc ) )
    {
        // Figure out which endpoint we are initializing
        idx = ep->bEndpointAddress & 0x7F;

        // Check interface and endpoint numbers against hardware capability
        if( idx >= State->EndpointCount || itfc->bInterfaceNumber > 3 )
            return S_FALSE;

        if( ep->bEndpointAddress & 0x80 )
            State->IsTxQueue[ idx ] = TRUE;

        // Set the maximum size of the endpoint hardware FIFO
        int endpointSize = ep->wMaxPacketSize;

        // If the endpoint maximum size in the configuration list is bogus
        if( endpointSize != 8 && endpointSize != 16 && endpointSize != 32 && endpointSize != 64 )
            return S_FALSE;

        State->MaxPacketSize[ idx ] = endpointSize;

        // assign queues
        QueueBuffers[ queueIdx ].Initialize( );           // Clear queue before use
        State->Queues[ idx ] = &QueueBuffers[ queueIdx ];  // Attach queue to endpoint
        queueIdx++;

        // *****************************************
        // iso endpoints are currently not supported
        // *****************************************
        if( ( ep->bmAttributes & 3 ) == USB_ENDPOINT_ATTRIBUTE_ISOCHRONOUS )
            return FALSE;

        // remember endpoint types
        epType |= ( ep->bmAttributes & 3 ) << ( idx * 2 );
    }

    // If no endpoints were initialized, something is seriously wrong with the configuration list
    if( epType == 0 )
        return S_FALSE;

    ( ( STM32H7_USB_STATE* )State )->EP_Type = epType;

    HAL_Time_Sleep_MicroSeconds( 1000 ); // asure host recognizes reattach

    // setup hardware
    CPU_USB_ProtectPins( Controller, FALSE );
	
	hal_printf(" USB 745 ");
	//OTG->GAHBCFG |= USB_OTG_GAHBCFG_GINT;
	//SET_BIT(PWR->CR3, PWR_CR3_USB33DEN);
	hal_printf(" USB 748 ");
			
    if( STM32H7_USB_IS_HS( Controller ) )
    { // HS
        CPU_INTC_ActivateInterrupt( OTG_HS_IRQn, STM32H7_USB_Driver_HS_Interrupt, 0 );
        CPU_INTC_ActivateInterrupt( OTG_HS_WKUP_IRQn, STM32H7_USB_Driver_HS_Interrupt, 0 );
    }
    else
    { // FS
        CPU_INTC_ActivateInterrupt( OTG_FS_IRQn, STM32H7_USB_Driver_FS_Interrupt, 0 );
        CPU_INTC_ActivateInterrupt( OTG_FS_WKUP_IRQn, STM32H7_USB_Driver_FS_Interrupt, 0 );
    }

    // allow interrupts
    OTG->GINTSTS = 0xFFFFFFFF;           // clear all interrupts
    OTG->GINTMSK = OTG_GINTMSK_USBRST;   // enable reset only
    OTG->DIEPEMPMSK = 0;                 // disable Tx FIFO empty interrupts
    OTG->GAHBCFG |= OTG_GAHBCFG_GINTMSK; // gloabl interrupt enable

    // rest of initializations done in reset interrupt handler

	////hal_printf(" * ");

    return S_OK;
}

