Samraksh/eMote44/DeviceCode/Targets/Native/STM32H7/DeviceCode/STM32H7_USB/prev/STM32H7_usb_functions_v.cpp
HRESULT CPU_USB_Uninitialize( int Controller )
{
    if( STM32H7_USB_IS_HS( Controller ) )
    { // HS
        CPU_INTC_DeactivateInterrupt( OTG_HS_WKUP_IRQn );
        CPU_INTC_DeactivateInterrupt( OTG_HS_IRQn );
    }
    else
    { // FS
        CPU_INTC_DeactivateInterrupt( OTG_FS_WKUP_IRQn );
        CPU_INTC_DeactivateInterrupt( OTG_FS_IRQn );
    }

    CPU_USB_ProtectPins( Controller, TRUE );
    
    // disable USB clock
    if( STM32H7_USB_IS_HS( Controller ) )
    { // HS on AHB1
        RCC->AHB1ENR &= ~RCC_AHB1ENR_USB1OTGHSEN;
    }
    else
    { // FS on AHB2
        RCC->AHB1ENR &= ~RCC_AHB1ENR_USB2OTGHSEN;
    }

    return S_OK;
}

BOOL CPU_USB_StartOutput( USB_CONTROLLER_STATE* State, int ep )
{
    if( State == NULL || ep >= State->EndpointCount )
        return FALSE;

    OTG_TypeDef* OTG = STM32H7_USB_REGS( State->ControllerNum );

    //////hal_printf(" t ");

    GLOBAL_LOCK( irq );

    // If endpoint is not an output
    if( State->Queues[ ep ] == NULL || !State->IsTxQueue[ ep ] )
        return FALSE;

    /* if the halt feature for this endpoint is set, then just clear all the characters */
    if( State->EndpointStatus[ ep ] & USB_STATUS_ENDPOINT_HALT )
    {
        while( USB_TxDequeue( State, ep, TRUE ) != NULL )
        {
        } // clear TX queue

        return TRUE;
    }

    if( irq.WasDisabled( ) )
    { // check all endpoints for pending actions
        STM32H7_USB_Driver_Interrupt( OTG, State );
    }
    // write first packet if not done yet
    STM32H7_USB_Driver_EP_In_Int( OTG, State, ep );

    return TRUE;
}

BOOL CPU_USB_RxEnable( USB_CONTROLLER_STATE* State, int ep )
{
    // If this is not a legal Rx queue
    if( State == NULL || State->Queues[ ep ] == NULL || State->IsTxQueue[ ep ] )
        return FALSE;

    OTG_TypeDef* OTG = STM32H7_USB_REGS( State->ControllerNum );

    ////hal_printf(" e ");

    GLOBAL_LOCK( irq );

    // enable Rx
    if( !( OTG->DOEP[ ep ].CTL & OTG_DOEPCTL_EPENA ) )
    {
        OTG->DOEP[ ep ].TSIZ = OTG_DOEPTSIZ_PKTCNT_1 | State->MaxPacketSize[ ep ];
        OTG->DOEP[ ep ].CTL |= OTG_DOEPCTL_EPENA | OTG_DOEPCTL_CNAK; // enable endpoint
    }

    return TRUE;
}

BOOL CPU_USB_GetInterruptState( ) // Controller missing!
{
    return FALSE;
}

BOOL CPU_USB_ProtectPins( int Controller, BOOL On )
{
    USB_CONTROLLER_STATE *State = &STM32H7_USB_ControllerState[ STM32H7_USB_IDX( Controller ) ].state;

    if( ( ( STM32H7_USB_STATE* )State )->EP_Type == 0 )
        return FALSE;  // not yet initialized

    OTG_TypeDef* OTG = STM32H7_USB_REGS( Controller );

    GLOBAL_LOCK( irq );

    if( On )
    {
        if( !( ( STM32H7_USB_STATE* )State )->pinsProtected )
        {
            ////hal_printf(" + ");

            ( ( STM32H7_USB_STATE* )State )->pinsProtected = TRUE;

            // detach usb port
            OTG->DCTL |= OTG_DCTL_SDIS; // soft disconnect

            // clear USB Txbuffer
            for( int ep = 1; ep < State->EndpointCount; ep++ )
            {
                if( State->Queues[ ep ] && State->IsTxQueue[ ep ] )
                {
                    while( USB_TxDequeue( State, ep, TRUE ) != NULL );  // clear TX queue
                }
            }

            State->DeviceState = USB_DEVICE_STATE_DETACHED;
            USB_StateCallback( State );
        }
    }
    else
    {
        if( ( ( STM32H7_USB_STATE* )State )->pinsProtected )
        {

            ////hal_printf(" - ");

            ( ( STM32H7_USB_STATE* )State )->pinsProtected = FALSE;

            GPIO_ALT_MODE altMode = STM32H7_USB_ALT_MODE( Controller );
            CPU_GPIO_DisablePin( STM32H7_USB_DM_PIN( Controller ), RESISTOR_DISABLED, 2, altMode );
            CPU_GPIO_DisablePin( STM32H7_USB_DP_PIN( Controller ), RESISTOR_DISABLED, 2, altMode );
            if( STM32H7_USB_USE_ID_PIN( Controller ) )
            {
                CPU_GPIO_DisablePin( STM32H7_USB_ID_PIN( Controller ), RESISTOR_DISABLED, 2, altMode );
            }
			//CPU_GPIO_DisablePin( STM32H7_USB_VB_PIN( Controller ), RESISTOR_DISABLED, 0, altMode );
			
            // attach usb port
            OTG->DCTL &= ~OTG_DCTL_SDIS; // remove soft disconnect
						
            State->DeviceState = USB_DEVICE_STATE_ATTACHED;
            USB_StateCallback( State );
        }
    }

    return TRUE;
}

